app/controllers/admin/journals_controller.rb

INSERT INTO "journals" ("created_at", "driver", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-07-08 00:56:09.356639"], ["driver", "ComputerDotOrg"], ["name", "computer.org"], ["updated_at", "2014-07-08 00:56:09.356639"]]
---
  def create
    @journal = Journal.new(journal_params)

    respond_to do |format|
      if @journal.save

UPDATE "journals" SET "name" = 'Computer.org', "updated_at" = '2014-07-08 01:00:03.854373', "lock_version" = 1 WHERE ("journals"."id" = 3 AND "journals"."lock_version" = 0)
---
  def update
    respond_to do |format|
      if @journal.update(journal_params)

SELECT  "journals".* FROM "journals"  WHERE "journals"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_journal
      @journal = Journal.find(params[:id])