app/controllers/admin/journal_accounts_controller.rb

INSERT INTO "journal_accounts" ("created_at", "journal_id", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-07-08 02:34:23.032548"], ["journal_id", 5], ["password", "library"], ["updated_at", "2014-07-08 02:34:23.032548"], ["username", "uinshj"]]
---
  def create
    @journal_account = @journal.journal_accounts.new(journal_account_params)
    respond_to do |format|
      if @journal_account.save

UPDATE "journal_accounts" SET "password" = 'librarian', "updated_at" = '2014-07-08 02:39:31.049654', "lock_version" = 1 WHERE ("journal_accounts"."id" = 1 AND "journal_accounts"."lock_version" = 0)
---
  def update
    respond_to do |format|
      if @journal_account.update(journal_account_params)

SELECT  "journal_accounts".* FROM "journal_accounts"  WHERE "journal_accounts"."journal_id" = $1 AND "journal_accounts"."id" = $2 LIMIT 1  [["journal_id", 5], ["id", 2]]
SELECT  "journals".* FROM "journals"  WHERE "journals"."id" = $1 LIMIT 1  [["id", 5]]
SELECT COUNT(*) FROM "journal_accounts"  WHERE "journal_accounts"."journal_id" = $1 AND (username like '%wrwer%' or password like '%wrwer%' or other like '%wrwer%')  [["journal_id", 5]]
UPDATE "journal_accounts" SET "enable" = 't', "updated_at" = '2014-07-08 02:49:58.142092', "lock_version" = 3 WHERE ("journal_accounts"."id" = 1 AND "journal_accounts"."lock_version" = 2)
UPDATE "journals" SET "offline_accounts_count" = COALESCE("offline_accounts_count", 0) + 1, "lock_version" = COALESCE("lock_version", 0) + 1 WHERE "journals"."id" = 5
---
  def set_status
    @journal_account = @journal.journal_accounts.find(params[:journal_account_id])
    @journal_account.toggle_enable